#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy.AmazonDynamoDBFullAccess_policy: Reading...
aws_apigatewayv2_api.apigateway: Refreshing state... [id=6bhxgw8x5e]
aws_iam_role.iam_for_lambda: Refreshing state... [id=lambda-dynamodb-role1]
aws_dynamodb_table.dynamodb-table: Refreshing state... [id=VisitorCount1]
aws_apigatewayv2_stage.example: Refreshing state... [id=$default]
aws_lambda_function.lambda_function: Refreshing state... [id=get_visitor_count1]
aws_apigatewayv2_integration.apigatewayv2_integration: Refreshing state... [id=juovjxe]
data.aws_iam_policy.AmazonDynamoDBFullAccess_policy: Read complete after 2s [id=arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess]
aws_iam_role_policy_attachment.attach_role: Refreshing state... [id=lambda-dynamodb-role1-20230204000720262000000001]
aws_apigatewayv2_route.example: Refreshing state... [id=0ngt76t]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_api.apigateway will be updated in-place
  ~ resource "aws_apigatewayv2_api" "apigateway" {
        id                           = "6bhxgw8x5e"
      ~ name                         = "visitor-count-api-gw-1" -> "visitor-count-api-gw"
        tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_integration.apigatewayv2_integration will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "apigatewayv2_integration" {
        id                     = "juovjxe"
      ~ integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:822691043233:function:get_visitor_count1/invocations" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_dynamodb_table.dynamodb-table must be replaced
-/+ resource "aws_dynamodb_table" "dynamodb-table" {
      ~ arn              = "arn:aws:dynamodb:us-east-1:822691043233:table/VisitorCount1" -> (known after apply)
      ~ id               = "VisitorCount1" -> (known after apply)
      ~ name             = "VisitorCount1" -> "VisitorCount" # forces replacement
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      ~ tags             = {
          ~ "Name"        = "dynamodb-table-1" -> "dynamodb-table"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Name"        = "dynamodb-table-1" -> "dynamodb-table"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      ~ ttl {
          + attribute_name = (known after apply)
          ~ enabled        = false -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # aws_iam_role.iam_for_lambda must be replaced
-/+ resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::822691043233:role/lambda-dynamodb-role1" -> (known after apply)
      ~ create_date           = "2023-02-04T00:07:18Z" -> (known after apply)
      ~ id                    = "lambda-dynamodb-role1" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess",
        ] -> (known after apply)
      ~ name                  = "lambda-dynamodb-role1" -> "lambda-dynamodb-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA37DBVC6Q6SHPV7PG5" -> (known after apply)
        # (4 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.attach_role must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_role" {
      ~ id         = "lambda-dynamodb-role1-20230204000720262000000001" -> (known after apply)
      ~ role       = "lambda-dynamodb-role1" -> "lambda-dynamodb-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.lambda_function must be replaced
-/+ resource "aws_lambda_function" "lambda_function" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:822691043233:function:get_visitor_count1" -> (known after apply)
      ~ function_name                  = "get_visitor_count1" -> "get_visitor_count" # forces replacement
      ~ id                             = "get_visitor_count1" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:822691043233:function:get_visitor_count1/invocations" -> (known after apply)
      ~ last_modified                  = "2023-02-04T12:15:09.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:822691043233:function:get_visitor_count1:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:822691043233:function:get_visitor_count1:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::822691043233:role/lambda-dynamodb-role1" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 602 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vantruongsinh, Action: `pull_request`*